const map = { 'q':'ض','w':'ص','e':'ث','r':'ق','t':'ف','y':'غ','u':'ع','i':'ه','o':'خ','p':'ح','[':'ج',']':'د','a':'ش','s':'س','d':'ي','f':'ب','g':'ل','h':'ا','j':'ت','k':'ن','l':'م',';':'ك',"'":'ط','z':'ئ','x':'ء','c':'ؤ','v':'ر','b':'لا','n':'ى','m':'ة',',':'و','.':'ز','/':'ظ',' ':' ','V':'ر','H':'أ','R':'ٌ','T':'لإ','Y':'إ','U':'‘','I':'÷','O':'×','P':'؛','{':'<','}':'>','A':'ِ','S':'ٍ','D':']','F':'[','G':'لأ','J':'ـ','K':'،','L':'/','Z':'~','X':'ْ','C':'}','B':'لآ','N':'آ','M':'’','<':',','>':'.'};

const str = "ich nhfx rmrg vnhdt ukv hgwghpd] td hkahV j[nf] glunt] hgla;g] mpgih ";
console.log(str.split('').map(c => map[c] || c).join(''));
